## 📋 Terraform Plan: `tier4_monitoring`

**Plan Status:** `success`
**Workspace:** [`tier4_monitoring`](https://app.terraform.io/app/aws-platform/workspaces/tier4_monitoring)

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aws-platform/tier4_monitoring/runs/run-xWodHAAMtVsLZdcG

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.compute: Refreshing...
aws_sns_topic.cloudwatch_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:433058264968:thrive-test-cloudwatch-alerts]
aws_sns_topic_subscription.email_alerts: Refreshing state... [id=arn:aws:sns:us-east-2:433058264968:thrive-test-cloudwatch-alerts:d9cb4e39-10ed-4c36-bfaa-667473c38a2e]
data.terraform_remote_state.compute: Refresh complete after 1s
data.aws_eks_cluster_auth.cluster: Refreshing...
data.aws_eks_cluster.cluster: Refreshing...
aws_cloudwatch_log_group.fluent_bit: Refreshing state... [id=/aws/containerinsights/thrive-test-eks/application]
aws_cloudwatch_dashboard.eks_monitoring: Refreshing state... [id=thrive-test-eks-monitoring]
aws_cloudwatch_metric_alarm.pod_restart_high: Refreshing state... [id=thrive-test-eks-pod-restart-high]
aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=thrive-test-eks-high-cpu-utilization]
data.aws_eks_cluster_auth.cluster: Refresh complete after 0s [id=thrive-test-eks]
aws_cloudwatch_metric_alarm.high_memory_utilization: Refreshing state... [id=thrive-test-eks-high-memory-utilization]
data.aws_eks_cluster.cluster: Refresh complete after 0s [id=thrive-test-eks]
aws_iam_role.cloudwatch_agent: Refreshing state... [id=thrive-test-cloudwatch-agent-role]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=thrive-test-cloudwatch-agent-role/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
aws_iam_role_policy_attachment.cloudwatch_container_insights: Refreshing state... [id=thrive-test-cloudwatch-agent-role/arn:aws:iam::aws:policy/CloudWatchLogsFullAccess]
aws_eks_addon.cloudwatch_observability: Refreshing state... [id=thrive-test-eks:amazon-cloudwatch-observability]
aws_eks_addon.cloudwatch_observability: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.cloudwatch_observability must be replaced
-/+ resource "aws_eks_addon" "cloudwatch_observability" {
      ~ addon_version               = "v4.3.0-eksbuild.1" -> (known after apply)
      ~ arn                         = "arn:aws:eks:us-east-2:433058264968:addon/thrive-test-eks/amazon-cloudwatch-observability/3ccc4e45-6639-e882-ec9e-6a138b0e3289" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2025-08-12T04:29:58Z" -> (known after apply)
      ~ id                          = "thrive-test-eks:amazon-cloudwatch-observability" -> (known after apply)
      ~ modified_at                 = "2025-08-12T04:30:33Z" -> (known after apply)
        tags                        = {
            "Company"     = "thrive"
            "Environment" = "test"
            "ManagedBy"   = "terraform"
            "Project"     = "aws-platform"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rafeed-w, Action: `pull_request`, Working Directory: `infra/tier4_monitoring`, Workflow: `Tier4 Monitoring`*